AcDbFaceRef.evaluateAndCacheGeometry
For now this method does nothing.

AcDbFaceRef.createEntity
Creates a new non-database resident AcDbEntity from the data the AcDbFaceRef
holds, and returns it to the caller. The caller is responsible for deleting
the entity after it is no more needed.

AcDbFaceRef.#ctor
Default constructor.

AcDbFaceRef
Reference to a face. It can either be represented by a face AcDbSubentId of
an ASM-based AcDbEntity (AcDbSurface, AcDb3dSolid, AcDbRegion) or by
a constant ASM BODY and the AcDbSubentId then specifies the index of the
face in the constant ASM BODY.